'''
pip install currency_converter

컴퓨터에서 최초 1회만 설치하면 다음부터 설치 안하고 사용 가능

삭제 방법
pip uninstall currency_converter

삭제를 했을 경우엔 다시 설치해야한다
'''

from currency_converter import CurrencyConverter
import re
# 여러번 다수 기능에서 사용할 변수명칭은 전역 변수로 사용

cc= CurrencyConverter()
def 정규식을_이용한_환율계산기() :
    기본통화 = "USD"
    변경통화 = "KRW"
    # +를 작성하지 않으면 딱 한 글자만, +를 작성하면 하나 이상

    영어만가능 = r'^[a-zA-Z]+$'
    숫자만가능 = r'^[\d]+$'

    숫자입력 = input("숫자를 입력하세요 : ")
    if re.match(숫자만가능, 숫자입력):
        변환결과 = cc.convert(숫자입력, 기본통화, 변경통화)
        print(f"변환결과 : {변환결과:.3f}원")
    else :
        print("숫자만 입력 가능합니다.")

정규식을_이용한_환율계산기()

    # 입력한 숫자가 숫자가 아닐 경우 숫자만 입력 가능합니다.
    # 숫자인 경우, 변환 결과 : 소수점 3자리 원까지 확인
'''
환율 변환 기능()을 만들 때 이 외에도 무수히 많은 방법 존재
좋은 방법이란 (AI 같이 결과 위주의 개발은 아님!)
1. 시간, 속도 빨라야함
2. 컴퓨터 메모리를 최소화하여 사용해야 한다.
3. 위 두가지가 동일하다면 이후부터는 회사와 개발자가 유지보수가 편리한 방법을 선택한다.
'''