'''
강사님은 뭐든 먹을 수 있다.
맛집: 엄용백 돼지국밥
지론 
1. 여자가 많다 : 가격은 비싸나 맛있는 지는 모르겠다
2. 남자가 많다 : 가격은 싸나 맛있는 지는 모르겠다
3. 할아버지 할머니 있는 집이 제일 맛있다.
'''
# 파이썬 한글화 : 시스템 환경 변수 편집 들어가서 처리 --> 고급 -> TJ에 대한 변수 PythonIOEncoding에 utf-8 추가 되어있나 확인.
# IO = Input, Output
# 시스템 변수 : 현재 연결 되어 있는 데스크톱 전체에 적용하는 설정
# TJ에 대한 사용자 변수 : 컴퓨터에서 특정 계정에만 적용하는 설정
# 시스템 환경 변수하는 곳은 개발자나 컴퓨터를 사용하는 편리하게 만들기 위한 공간
# 사용자 환경 변수 - 실수 해도 나의 계정만 문제가 생기기 때문에 복구 쉬움
# 시스템 환경 변수 - 실수하면 윈도우 기능이 먹통 될 수 있다.
# 환경 변수를 설정하는 것은 미리 컴퓨터에게 이 폴더는 자주 사용하는 폴더이니 기억을 했으면 좋겠어 등록하는 것임.
